app/controllers/movies_controller.rb

  def index
  	if params[:sort_by_title] == 'true'
  		@title_header = 'hilite'
  		@movies = Movie.find(:all, :order => 'title')
  	elsif params[:sort_by_release_date] == 'true'
  		@release_date_header = 'hilite'
  		@movies = Movie.find(:all, :order => 'release_date')
  	else
    	@movies = Movie.all
    end

    @all_ratings = Movie.all_ratings

    if params[:commit] == 'Refresh'
    	@selected_ratings = params[:ratings]
    	@movies = Movie.find_all_by_rating(@selected_ratings.keys)
---
SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'NC-17', 'R')

  def update
    @movie = Movie.find params[:id]
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "15"]]